---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceRotation
source: html/3a1b6772-e7e6-78e0-91e2-63b578733413.htm
---
# Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceRotation Property

The property labeled "Rotation" from the "AdvancedTransparent" schema.

## Syntax (C#)
```csharp
public static string SurfaceRotation { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.